package lesson03;

public class Task01 {

    /**
     * **Задача на конкатенацию строк:** Создайте две строковые переменные,
     * например, `firstName` и `lastName`.
     * Присвойте им какие-либо имена и фамилии.
     * Затем объедините их в одну строку `fullName` и выведите результат на экран.
     */
    public static void main(String[]args){
        System.out.println("Привет, я Олия, мне 48 лет, у меня две дочки и я бабушка троих очаровашек.");
        System.out.println("Родом я из Казахстана, живу на четыре страны, веду бизнес в пяти странах.");
        System.out.println("В 40 лет уехала в Африку и начала жизнь с нуля, там и произошло моё перевоплощение.... ");
        System.out.println("Очень люблю инвестировать в свое обучение, постоянно ставлю перед собой сложные задачи, " +
                "вот и сейчас я по этой же причине здесь:)");
        System.out.println("Активно помогаю в сборе денег детям больных раком из Казахстана, " +
                "в планах построить центр на Алтае для реабилитации, кто потерял детей. ");
        System.out.println("В свободное время люблю дайвинг, походы на яхте, пишу картины, " +
                "медитация, поющие чаши, мандала танцы и много чего еще...  ");
        System.out.println("В планах через два года уехать в Австралию с одним рюкзаком....");


    }
}
